# D = b**2 + 4ac
# coding: utf8
# figlet
print(""" 
 ____  _     _         _           _                   _            ___   _ 
|  _ \(_)___| | ___ __(_)_ __ ___ (_)_ __   __ _ _ __ | |_  __   __/ _ \ / |
| | | | / __| |/ / '__| | '_ ` _ \| | '_ \ / _` | '_ \| __| \ \ / / | | || |
| |_| | \__ \   <| |  | | | | | | | | | | | (_| | | | | |_   \ V /| |_| || |
|____/|_|___/_|\_\_|  |_|_| |_| |_|_|_| |_|\__,_|_| |_|\__|   \_/  \___(_)_|
""")
print("~~Diskriminant v0.1~~\nПрограмма создана для нахождения корней квадратного уравнение через дискриминант.")
while 1 == 1:
    a = int(input("\nВпишите a: "))
    b = int(input("Впишите b: "))
    c = int(input("Впишите c: "))
    D = b**2 - 4 * a * c
    print("\nДискриминант равен ", D)
    #x = (-b +- vD) / 2a
    x1 = (-b - D** .5) / 2 * a
    x2 = (-b + D** .5) / 2 * a
    print("x1 = {}, \nx2 = {}".format(x1,x2))
    ans = int(input("Введите 0, если хотите продолжить, или 1, если хотите закончить выполнение программы: "))
    if ans == 1:
        print("\nДо встречи!\nЕсли у вас что-то неработает, видать, у вас Windows :)")
        print("                              [powered by Матвей Величко, telegram: @matthew_velychko]")
        break
